#Задача 3.Напишите программу, в которой пользователь вводит целое число от 1 до 7 включительно,
# а программа выводит название дня недели, соответствующее этому числу
# ("Понедельник" для 1, "Вторник " для 2, и так далее).

a = int(input("Введите число от 1 до 7: "))
b = a + 1
c = a + 2
if a >= "a" :
    print("Понедельник")
    elif a = b:
        print("Вторник")
    elif a >= "c":
        print("Среда")
    else:
        print("Попробуйте ввести данные от 1 до 7")

